In [1]:
import numpy as np
import pandas as pd

In [2]:
path = "/content/drive/MyDrive/study/dataset/titanic/"

df_train = pd.read_csv(path+"train.csv")
df_test = pd.read_csv(path+"test.csv")

df = pd.concat([df_train, df_test], sort=False)
print(len(df))
df.head()

1309

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

性別を0/1に変換

In [3]:
df['Sex'].replace(['male','female'], [0, 1], inplace=True)

Embarkedを数値に変換(欠損箇所はSで補完)

In [4]:
df['Embarked'].fillna(('S'), inplace=True)
df['Embarked'] = df['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

Fareの欠損箇所を標本平均で補完

In [5]:
df['Fare'].fillna(np.mean(df['Fare']), inplace=True)

Ageの欠損箇所を中央値で補完

In [6]:
df['Age'].fillna(df['Age'].median(), inplace=True)

何人家族で乗船しているかのFamilySizeを追加

In [7]:
df['FamilySize'] = df['Parch'] + df['SibSp'] + 1

独り身は死にやすいのでIsAloneを追加

In [8]:
df['IsAlone'] = 0
df.loc[df['FamilySize'] == 1, 'IsAlone'] = 1

In [9]:
df_train_add_f = df.iloc[:len(df_train)].copy()
df_test_add_f = df.iloc[len(df_train):].copy()

df_train_add_f.to_csv(path + "train_add_f.csv", index=None)
df_test_add_f.to_csv(path + "test_add_f.csv", index=None)

In [10]:
df_train = pd.read_csv(path+"train_add_f.csv")
df_test = pd.read_csv(path+"test_add_f.csv")

df = pd.concat([df_train, df_test], sort=False)
print(len(df))
df.head()

1309

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone
0,1,0.0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0,2,0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1,2,0
2,3,1.0,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,1,1
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0,2,0
4,5,0.0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0,1,1